common/src/test/resources/xml/namespace-message2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nsXXX="http://www.example.org">
	<soapenv:Header />
	<soapenv:Body>
		<test2 xmlns="http://www.example.org/schema">
			<number attr="nsXXX:test">0</number>
			<text>${IGNORE}</text>
		</test2>
	</soapenv:Body>
</soapenv:Envelope>